CREATE OR REPLACE PACKAGE FCPA_DATE_UTIL
-- ==============================================================================
-- 機能      日付関連ユーティリティパッケージ
-- 作成者    H.Katayama
-- 作成日付  2007-07-27
-- 改版履歴  2007-07-27 H.Katayama 初版作成
--           2009-08-25 H.Katayama F_MCSYSDATE、F_MCSYSTIMESATMP を追加
--           2009-09-18 H.Katayama F_NEXT_DAY を追加
--           2014-11-18 A.Shimao F_GET_WEEK_OF_DAY、F_NEXT_DAYにRESULT_CACHEの指定を追加
--
-- バージョン:6.00
-- =============================================================================
IS
	-- 日曜日を示すの値です。
	SUNDAY NUMBER(1) := 1;
	-- 月曜日を示すの値です。
	MONDAY NUMBER(1) := 2;
	-- 火曜日を示すの値です。
	TUESDAY NUMBER(1) := 3;
	-- 水曜日を示すの値です。
	WEDNESDAY NUMBER(1) := 4;
	-- 木曜日を示すの値です。
	THURSDAY NUMBER(1) := 5;
	-- 金曜日を示すの値です。
	FRIDAY NUMBER(1) := 6;
	-- 土曜日を示すの値です。
	SATURDAY NUMBER(1) := 7;

	-- ===============================================================================
	--  Dateより、曜日の値を返します。
	--  返す値は、Javaの仕様にあわせています。
	--  日 = 1
	--  月 = 2
	--  火 = 3
	--  水 = 4
	--  木 = 5
	--  金 = 6
	--  土 = 7
	-- ===============================================================================
	FUNCTION F_GET_WEEK_OF_DAY(
		PD IN DATE
	) RETURN NUMBER RESULT_CACHE;

	-- ===============================================================================
	--  指定された曜日で、引数の日付より後の最初の日付をを返します。
	--  日 = 1
	--  月 = 2
	--  火 = 3
	--  水 = 4
	--  木 = 5
	--  金 = 6
	--  土 = 7
	-- ===============================================================================
	FUNCTION F_NEXT_DAY(
		PD IN DATE,
		ND IN NUMBER
	) RETURN DATE RESULT_CACHE;

	-- 年月日時分秒を示す定数
	C_Y4MDHMS VARCHAR2(8) := 'Y4MDHMS';
	-- 年月日を示す定数
	C_Y4MD VARCHAR2(8) := 'Y4MD';
	-- 年月を示す定数
	C_Y4M VARCHAR2(8) := 'Y4M';

	-- 年月日時分秒を示す定数
	C_Y2MDHMS VARCHAR2(8) := 'Y2MDHMS';
	-- 年月日を示す定数
	C_Y2MD VARCHAR2(8) := 'Y2MD';

	-- 時分秒を示す定数
	C_HMS VARCHAR2(8)  := 'HMS';


	-- 年月日時分秒(0.001秒まで）を示す定数
	C_Y4MDHMSF VARCHAR2(8) := 'Y4MDHMSF';
	-- 年月日時分秒(0.001秒まで）を示す定数
	C_Y2MDHMSF VARCHAR2(8) := 'Y2MDHMSF';
	-- 時分秒(0.001秒まで）を示す定数
	C_HMSF VARCHAR2(8)  := 'HMSF';

	-- ===============================================================================
	-- 年月日時分秒を示す定数を返します。
	-- ===============================================================================
	FUNCTION Y4MDHMS
	RETURN VARCHAR2;

	-- ===============================================================================
	-- 年月日を示す定数を返します。
	-- ===============================================================================
	FUNCTION Y4MD
	RETURN VARCHAR2;

	-- ===============================================================================
	-- 年月を示す定数を返します。
	-- ===============================================================================
	FUNCTION Y4M
	RETURN VARCHAR2;

	-- ===============================================================================
	-- 年月日時分秒を示す定数を返します。
	-- ===============================================================================
	FUNCTION Y2MDHMS
	RETURN VARCHAR2;

	-- ===============================================================================
	-- 年月日を示す定数を返します。
	-- ===============================================================================
	FUNCTION Y2MD
	RETURN VARCHAR2;

	-- ===============================================================================
	-- 時分秒を示す定数を返します。
	-- ===============================================================================
	FUNCTION HMS
	RETURN VARCHAR2;

	-- ===============================================================================
	-- 年月日時分秒(0.001秒まで）を示す定数を返します。
	-- ===============================================================================
	FUNCTION Y4MDHMSF
	RETURN VARCHAR2;

	-- ===============================================================================
	-- 年月日時分秒(0.001秒まで）を示す定数を返します。
	-- ===============================================================================
	FUNCTION Y2MDHMSF
	RETURN VARCHAR2;

	-- ===============================================================================
	-- 時分秒(0.001秒まで）を示す定数を返します。
	-- ===============================================================================
	FUNCTION HMSF
	RETURN VARCHAR2;


	-- ===============================================================================
	-- 引数のロケール情報に合わせた書式で、日付データを文字列化します。
	-- ===============================================================================
	FUNCTION F_TO_CHAR(
		PD IN DATE,
		FM IN VARCHAR2,
		LOCALE IN VARCHAR2
	) RETURN VARCHAR2 ;

	-- ===============================================================================
	-- セッションのロケール情報に合わせた書式で、日付データを文字列化します。
	-- ===============================================================================
	FUNCTION F_TO_CHAR(
		PD IN DATE,
		FM IN VARCHAR2
	) RETURN VARCHAR2 ;

	-- ===============================================================================
	-- 引数のロケール情報に合わせた書式で、日付データを文字列化します。
	-- ===============================================================================
	FUNCTION F_TO_CHAR_T(
		PT IN TIMESTAMP,
		FM IN VARCHAR2,
		LOCALE IN VARCHAR2
	) RETURN VARCHAR2 ;

	-- ===============================================================================
	-- セッションのロケール情報に合わせた書式で、日付データを文字列化します。
	-- ===============================================================================
	FUNCTION F_TO_CHAR_T(
		PT IN TIMESTAMP,
		FM IN VARCHAR2
	) RETURN VARCHAR2 ;

	-- ===============================================================================
	-- システム日付をDATE型で返します。
	-- ===============================================================================
	FUNCTION F_MCSYSDATE
	RETURN DATE;

	-- ===============================================================================
	-- 会社別システム日付をDATE型で返します。
	-- ===============================================================================
	FUNCTION F_MCSYSDATE_CO(
		I$CO_CD IN VARCHAR
	)
	RETURN DATE;

	-- ===============================================================================
	-- 会社別システム日付をTIMESATMP型で返します。
	-- ===============================================================================
	FUNCTION F_MCSYSTIMESTAMP_CO(
		I$CO_CD IN VARCHAR
	)
	RETURN TIMESTAMP;

	-- ===============================================================================
	-- システム日付をTIMESATMP型で返します。
	-- ===============================================================================
	FUNCTION F_MCSYSTIMESTAMP
	RETURN TIMESTAMP;

	-- ===============================================================================
	-- mcframe7のシステム日付を設定します。
	-- ===============================================================================
	PROCEDURE SET_MCSYSTIMESTAMP(I$TS IN TIMESTAMP);

	-- ===============================================================================
	-- 会社別システム日付を設定します。
	-- ===============================================================================
	PROCEDURE SET_MCSYSTIMESTAMP_CO(
		I$CO_CD IN VARCHAR,
		I$TS   IN  TIMESTAMP
	);

	-- ===============================================================================
	-- 運用日付を取得します。
	-- ===============================================================================
	FUNCTION F_GET_TODAY
	RETURN DATE;

	-- ===============================================================================
	-- 会社ＣＤを指定して運用日付を取得します。
	-- ===============================================================================
	FUNCTION F_GET_TODAY(
		I$CO_CD IN VARCHAR
	)
	RETURN DATE;

	-- ===============================================================================
	-- 運用日付を1日更新します。
	-- 本プロシージャではコミットしません。
	-- ===============================================================================
	PROCEDURE P_INCREMENT_TODAY (
		O_RET OUT NUMBER,
		O_TODAY_OLD OUT DATE,
		O_TODAY_NEW OUT DATE
	);

END FCPA_DATE_UTIL;
/
