CREATE OR REPLACE PACKAGE FCPA_CONTEXT
-- ==============================================================================
-- 機能      アプリケーションコンテキストの代替機能
-- 作成者    H.KATAYAMA
-- 作成日付  2008-04-10
-- 改版履歴  2007-07-27 H.KATAYAMA 初版作成
--           2007-11-06 H.KATAYAMA F_GET_LANGUAGEを追加
--           2008-01-29 H.KATAYAMA 各SETTERを追加
--           2008-04-10 H.KUBO 定数を返すファンクションを追加。それに伴い定数名を変更
--           2008-04-10 H.KATAYAMA FCT_LOGINのARC_CD、CLT_IDを追加
--           2008-07-02 H.KATAYAMA DBのコンテキストは使用しない。
--           2008-07-28 H.KATAYAMA LOCALEを追加
--           2011-04-14 H.KATAYAMA 変数定義にメタを使用
--           2011-05-24 H.KATAYAMA CALL_PG_IDを使用
--           2013-03-01 H.KATAYAMA CALL_PG_IDのメタを変更
--           2013-04-04 H.KATAYAMA FCPA_META.REQ_NOをFCPA_META.SRV_REQ_NOに変更
--           2013-06-12 H.KATAYAMA GET_CONTEXT_ALL、SET_CONTEXT_ALLを追加
--           2014-01-24 H.KATAYAMA V_OS_USR、F_GET_OS_USERを追加
--           2014-10-24 Y.TAKAIWA SET_CONTEXT_USERのオーバーロードを追加
--           2015-09-28 S.SUZUKI F_GET_CO_CDを追加
--           2016-02-10 Y.TAKAIWA F_GET_DEF_LOCALE_CDを追加
--           2016-05-30 S.SUZUKI SET_CONTEXT_USERのオーバーロードを削除
--           2016-07-12 S.SUZUKI GP_BATCH_GRP_CDを追加
--
-- バージョン:6.3.1
-- ==============================================================================
IS
--	-- MCFRAME標準のネームスペース
	
	C_PROCESS_ID VARCHAR2(30) := 'PROCESS_ID';
	V_PROCESS_ID VARCHAR2(50 char); -- FCPA_META.SRV_REQ_NO%TYPE

	C_USER_ID VARCHAR2(30) := 'USER_ID';
	V_USER_ID VARCHAR2(500 char); -- FCPA_META.USR_ID%TYPE

	C_USER_NM VARCHAR2(30) := 'USER_NM';
	V_USER_NM VARCHAR2(40 char); -- FCPA_META.USR_NM%TYPE

	C_LOGIN_SEQ VARCHAR2(30) := 'LOGIN_SEQ';
	V_LOGIN_SEQ VARCHAR2(50 char); -- FCPA_META.USR_LOGIN_SEQ%TYPE

	C_CO_CD VARCHAR2(30) := 'CO_CD';
	V_CO_CD VARCHAR2(10 char); -- FCPA_META.CO_CD%TYPE
	V_DEF_LOCALE_CD VARCHAR2(20 char); -- FCPA_META.LOCALE_CD%TYPE

	C_EXT_ATTR1 VARCHAR2(30) := 'EXT_ATTR1';
	V_EXT_ATTR1 VARCHAR2(50 char); -- FCPA_META.USR_EXT_ATTR%TYPE

	C_EXT_ATTR2 VARCHAR2(30) := 'EXT_ATTR2';
	V_EXT_ATTR2 VARCHAR2(50 char); -- FCPA_META.USR_EXT_ATTR%TYPE

	C_EXT_ATTR3 VARCHAR2(30) := 'EXT_ATTR3';
	V_EXT_ATTR3 VARCHAR2(50 char); -- FCPA_META.USR_EXT_ATTR%TYPE

	C_ACTION_ID VARCHAR2(30) := 'ACTION_ID';
	V_ACTION_ID VARCHAR2(15 char); -- FCPA_META.ACTION_ID%TYPE

	C_LANGUAGE VARCHAR2(30)  := 'LANGUAGE';
	V_LANGUAGE VARCHAR2(4000);

	C_ARC_CD VARCHAR2(30)    := 'ARC_CD';
	V_ARC_CD VARCHAR2(3 char); -- FCPA_META.ARC_CD%TYPE

	C_CLT_ID VARCHAR2(30)    := 'CLT_ID';
	V_CLT_ID VARCHAR2(50 char); -- FCPA_META.MACHINE%TYPE

	C_LOCALE VARCHAR2(30)    := 'LOCALE';
	V_LOCALE VARCHAR2(20 char); -- FCPA_META.LOCALE_CD%TYPE

	C_CALL_PG_ID VARCHAR2(30)    := 'CALL_PG_ID';
	V_CALL_PG_ID VARCHAR2(50 char); -- FCPA_META.CALL_PG_ID%TYPE

	V_OS_USR VARCHAR2(500 char); -- FCPA_META.USR_ID%TYPE

	V_GP_BATCH_GRP_CD VARCHAR2(50 char); -- FCPA_META.GP_BATCH_GRP_CD%TYPE
	
	-- ===============================================================================
	-- ＤＢコネクションのプロセスＩＤを取得するためのキー値
	-- ===============================================================================
	FUNCTION PROCESS_ID_KEY
	RETURN VARCHAR2;
	
	-- ===============================================================================
	-- ＤＢコネクションのユーザＩＤを取得するためのキー値
	-- ===============================================================================
	FUNCTION USER_ID_KEY
	RETURN VARCHAR2;
	
	-- ===============================================================================
	-- ＤＢコネクションのユーザ名を取得するためのキー値
	-- ===============================================================================
	FUNCTION USER_NM_KEY
	RETURN VARCHAR2;
	
	-- ===============================================================================
	-- ＤＢコネクションのログインシーケンスを取得するためのキー値
	-- ===============================================================================
	FUNCTION LOGIN_SEQ_KEY
	RETURN VARCHAR2;
	
	-- ===============================================================================
	-- ＤＢコネクションの会社ＣＤを取得するためのキー値
	-- ===============================================================================
	FUNCTION CO_CD_KEY
	RETURN VARCHAR2;
	
	-- ===============================================================================
	-- ＤＢコネクションの属性１を取得するためのキー値
	-- ===============================================================================
	FUNCTION EXT_ATTR1_KEY
	RETURN VARCHAR2;
	
	-- ===============================================================================
	-- ＤＢコネクションの属性２を取得するためのキー値
	-- ===============================================================================
	FUNCTION EXT_ATTR2_KEY
	RETURN VARCHAR2;
	
	-- ===============================================================================
	-- ＤＢコネクションの属性３を取得するためのキー値
	-- ===============================================================================
	FUNCTION EXT_ATTR3_KEY
	RETURN VARCHAR2;
	
	-- ===============================================================================
	-- ＤＢコネクションのアクションＩＤを取得するためのキー値
	-- ===============================================================================
	FUNCTION ACTION_ID_KEY
	RETURN VARCHAR2;
	
	-- ===============================================================================
	-- ＤＢコネクションの言語情報を取得するためのキー値
	-- ===============================================================================
	FUNCTION LANGUAGE_KEY
	RETURN VARCHAR2;

	-- ===============================================================================
	-- ＤＢコネクションのアーキテクチャCDを取得するためのキー値
	-- ===============================================================================
	FUNCTION ARC_CD_KEY
	RETURN VARCHAR2;

	-- ===============================================================================
	-- ＤＢコネクションのクライアントIDを取得するためのキー値
	-- ===============================================================================
	FUNCTION CLT_ID_KEY
	RETURN VARCHAR2;

	-- ===============================================================================
	-- ＤＢコネクションのロケールを取得するためのキー値
	-- ===============================================================================
	FUNCTION LOCALE_KEY
	RETURN VARCHAR2;

	-- ===============================================================================
	-- 呼び出し元プログラムＩＤを取得するためのキー値
	-- ===============================================================================
	FUNCTION C_CALL_PG_ID_KEY
	RETURN VARCHAR2;


	-- ===============================================================================
	-- ＤＢコネクションのプロセスＩＤを取得する
	-- ===============================================================================
	FUNCTION F_GET_PROCESSID
	RETURN VARCHAR2;
	-- ===============================================================================
	-- ＤＢコネクションのプロセスＩＤを設定する
	-- ===============================================================================
	PROCEDURE SET_PROCESSID(I$PROSESSID IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションのユーザＩＤを取得する
	-- ===============================================================================
	FUNCTION F_GET_USERID
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- ＤＢコネクションのユーザＩＤを設定する
	-- ===============================================================================
	PROCEDURE SET_USERID(I$USER_ID IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションのユーザ名を取得する
	-- ===============================================================================
	FUNCTION F_GET_USERNM
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- ＤＢコネクションのユーザ名を設定する
	-- ===============================================================================
	PROCEDURE SET_USERNM(I$USER_NM IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションのログインシーケンスを取得する
	-- ===============================================================================
	FUNCTION F_GET_LOGIN_SEQ
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- ＤＢコネクションのログインシーケンスを設定する
	-- ===============================================================================
	PROCEDURE SET_LOGIN_SEQ(I$SEQ IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションのアクションＩＤを取得する
	-- ===============================================================================
	FUNCTION F_GET_ACTION_ID
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- ＤＢコネクションのアクションＩＤを設定する
	-- ===============================================================================
	PROCEDURE SET_ACTION_ID(I$ACTION_ID IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションの会社ＣＤを取得する
	-- ===============================================================================
	FUNCTION F_GET_CO_CD
	RETURN VARCHAR2 ;
  
  -- ===============================================================================
	-- ＤＢコネクションの会社ＣＤの標準ロケールを取得する
	-- ===============================================================================
	FUNCTION F_GET_DEF_LOCALE_CD
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- ＤＢコネクションの会社ＣＤを設定する
	-- ===============================================================================
	PROCEDURE SET_CO_CD(I$CO_CD IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションの属性１を取得する
	-- ===============================================================================
	FUNCTION F_GET_EXT_ATTR1
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- ＤＢコネクションの属性１を設定する
	-- ===============================================================================
	PROCEDURE SET_EXT_ATTR1(I$ATTR1 IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションの属性２を取得する
	-- ===============================================================================
	FUNCTION F_GET_EXT_ATTR2
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- ＤＢコネクションの属性２を設定する
	-- ===============================================================================
	PROCEDURE SET_EXT_ATTR2(I$ATTR2 IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションの属性３を取得する
	-- ===============================================================================
	FUNCTION F_GET_EXT_ATTR3
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- ＤＢコネクションの属性３を設定する
	-- ===============================================================================
	PROCEDURE SET_EXT_ATTR3(I$ATTR3 IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションの言語情報を取得する
	-- ===============================================================================
	FUNCTION F_GET_LANGUAGE
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- ＤＢコネクションの言語情報を設定する
	-- ===============================================================================
	PROCEDURE SET_LANGUAGE(I$LANG IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションのアーキテクチャCDを取得する
	-- ===============================================================================
	FUNCTION F_GET_ARC_CD
	RETURN VARCHAR2;
	-- ===============================================================================
	-- ＤＢコネクションのアーキテクチャCDを設定する
	-- ===============================================================================
	PROCEDURE SET_ARC_CD(I$ARC_CD IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションのクライアントIDを取得する
	-- ===============================================================================
	FUNCTION F_GET_CLT_ID
	RETURN VARCHAR2;
	-- ===============================================================================
	-- ＤＢコネクションのクライアントIDを設定する
	-- ===============================================================================
	PROCEDURE SET_CLT_ID(I$CLT_ID IN VARCHAR2);

	-- ===============================================================================
	-- ＤＢコネクションのロケールを取得する
	-- ===============================================================================
	FUNCTION F_GET_LOCALE
	RETURN VARCHAR2;
	-- ===============================================================================
	-- ＤＢコネクションのロケールを設定する
	-- ===============================================================================
	PROCEDURE SET_LOCALE(I$LOCALE IN VARCHAR2);

	-- ===============================================================================
	-- 呼び出し元プログラムＩＤを取得する
	-- ===============================================================================
	FUNCTION F_GET_CALL_PG_ID
	RETURN VARCHAR2;
	-- ===============================================================================
	-- 呼び出し元プログラムＩＤを設定する
	-- ===============================================================================
	PROCEDURE SET_CALL_PG_ID(I$CALL_PG_ID IN VARCHAR2);


	-- ===============================================================================
	-- 汎用バッチ処理グループＣＤを取得する
	-- ===============================================================================
	FUNCTION F_GET_GP_BATCH_GRP_CD
	RETURN VARCHAR2;
	-- ===============================================================================
	-- 汎用バッチ処理グループＣＤを設定する
	-- ===============================================================================
	PROCEDURE SET_GP_BATCH_GRP_CD(I$GP_BATCH_GRP_CD IN VARCHAR2);


	-- ===============================================================================
	-- MCFRAME標準のネームスペースへの属性設定
	-- ===============================================================================
	PROCEDURE SET_CONTEXT(
		P$ATTRIBUTE  IN VARCHAR2,  --属性名称
		P$AVALUE  IN VARCHAR2      --値
	);

	-- ===============================================================================
	-- MCFRAME標準のネームスペースへの属性取得
	-- ===============================================================================
	FUNCTION GET_CONTEXT(
		P$ATTRIBUTE  IN VARCHAR2  --属性名称
	)
	RETURN VARCHAR2;

	-- ===============================================================================
	-- すべての属性取得
	-- ===============================================================================
	PROCEDURE GET_CONTEXT_ALL(
		O$PROCESSID   OUT VARCHAR2,
		O$USERID      OUT VARCHAR2,
		O$USERNM      OUT VARCHAR2,
		O$LOGIN_SEQ   OUT VARCHAR2,
		O$CO_CD       OUT VARCHAR2,
		O$EXT_ATTR1   OUT VARCHAR2,
		O$EXT_ATTR2   OUT VARCHAR2,
		O$EXT_ATTR3   OUT VARCHAR2,
		O$ACTION_ID   OUT VARCHAR2,
		O$LANGUAGE    OUT VARCHAR2,
		O$ARC_CD      OUT VARCHAR2,
		O$CLT_ID      OUT VARCHAR2,
		O$LOCALE      OUT VARCHAR2,
		O$CALL_PG_ID  OUT VARCHAR2
	);

	-- ===============================================================================
	-- すべての属性設定
	-- ===============================================================================
	PROCEDURE SET_CONTEXT_ALL(
		I$PROCESSID   IN VARCHAR2,
		I$USERID      IN VARCHAR2,
		I$USERNM      IN VARCHAR2,
		I$LOGIN_SEQ   IN VARCHAR2,
		I$CO_CD       IN VARCHAR2,
		I$EXT_ATTR1   IN VARCHAR2,
		I$EXT_ATTR2   IN VARCHAR2,
		I$EXT_ATTR3   IN VARCHAR2,
		I$ACTION_ID   IN VARCHAR2,
		I$LANGUAGE    IN VARCHAR2,
		I$ARC_CD      IN VARCHAR2,
		I$CLT_ID      IN VARCHAR2,
		I$LOCALE      IN VARCHAR2,
		I$CALL_PG_ID  IN VARCHAR2,
		I$GP_BATCH_GRP_CD  IN VARCHAR2
	);


	-- ===============================================================================
	-- MCFRAME標準のネームスペースへの属性クリア
	-- ===============================================================================
	PROCEDURE CLEAR_CONTEXT(
		P$ATTRIBUTE  IN VARCHAR2  --属性名称
	);

	-- ===============================================================================
	-- すべてのアプリケーションコンテキストの削除
	-- ===============================================================================
	PROCEDURE CLEAR_ALL_CONTEXT;

	-- ===============================================================================
	-- ユーザ情報をアプリケーションコンテキストに設定します。
	-- 戻り値(O$RETURNCD)：0=正常
	--                     1=S_LOGINに情報がない
	--                     9=異常終了
	-- ===============================================================================

	PROCEDURE SET_CONTEXT_USER(
		I$PROSESSID   IN  VARCHAR2,
		I$USER_ID     IN  VARCHAR2,
		I$USER_NM     IN  VARCHAR2,
		I$SEQ         IN  VARCHAR2,
		I$ACTION_ID   IN  VARCHAR2,
		I$LOCALE      IN  VARCHAR2,
		I$CALL_ID     IN  VARCHAR2,
		O$RETURNCD    OUT VARCHAR2,
		O$MSG         OUT VARCHAR2,
		I$CO_CD       IN VARCHAR2,
		I$EXT_ATTR1   IN VARCHAR2,
		I$EXT_ATTR2   IN VARCHAR2,
		I$EXT_ATTR3   IN VARCHAR2,
		O$LANGUAGE    OUT VARCHAR2,
		O$CLT_ID      OUT VARCHAR2
	);

	-- ===============================================================================
	-- ユーザ情報をアプリケーションコンテキストに設定します。
	-- ===============================================================================

	PROCEDURE SET_CONTEXT_USER(
		I$CO_CD       IN VARCHAR2,
		I$EXT_ATTR1   IN VARCHAR2,
		I$EXT_ATTR2   IN VARCHAR2,
		I$EXT_ATTR3   IN VARCHAR2
	);

	-- ===============================================================================
	-- CO_VIEW参照のための情報をアプリケーションコンテキストに設定します。
	-- ===============================================================================

	PROCEDURE SET_CONTEXT_COVIEW(
		I$CO_CD       IN VARCHAR2,
		I$LOCALE      IN  VARCHAR2
	);

	-- ===============================================================================
	-- 接続中のOSユーザを返す
	-- ===============================================================================
	FUNCTION F_GET_OS_USR
	RETURN VARCHAR2;

END;
/

