CREATE OR REPLACE PACKAGE MGPA_CALC_ST_STK
/**************************************************************************
<SYNOPSIS>
	月初在庫評価替処理
<REMARKS>
	月初在庫金額を該当期の確定標準原価単価で評価替を行う。
	対象となる計算グループＣＤに対して計算グループカテゴリマスタに対して
	設定されている原価計算品目の計算カテゴリＣＤに対する確定情報を使用する。

<ARGUMENTS>
<HISTORY>
**************************************************************************/
IS

PROCEDURE P_MAIN 
;
/**************************************************************************
<SYNOPSIS>
	月初在庫評価替メイン処理
<REMARKS>
	MGW_ST_STK_KEYに対象となるデータを設定しておく必要がある。
	評価替差異はMGT_ST_STK_DIFFに書き込む。
<ARGUMENTS>

<HISTORY>
**************************************************************************/

END MGPA_CALC_ST_STK ;
/
