CREATE OR REPLACE PACKAGE MGPA_DEL_CALC
/**************************************************************************
<SYNOPSIS>
	原価計算結果削除処理
<REMARKS>

<ARGUMENTS>
<HISTORY>
**************************************************************************/
IS

PROCEDURE P_MAIN ;
/*********************************************************
<SYNOPSIS>
	削除メイン処理
<REMARKS>
	MGW_DEL_CALCに対象となるデータを設定しておく必要がある
<ARGUMENTS>

<HISTORY>
**********************************************************/

END MGPA_DEL_CALC ;
/
