CREATE OR REPLACE PACKAGE MGPA_PRE_ALC
/**************************************************************************
<SYNOPSIS>
	一次配賦計算
<REMARKS>

<ARGUMENTS>
<HISTORY>
**************************************************************************/
IS

PROCEDURE P_SET_INPUT_DATA (
	I_ARG	IN MGT_ARG%ROWTYPE
) ;
/**************************************************************************
<SYNOPSIS>
	一次配賦計算用入力データの作成前処理
<REMARKS>
	一次配賦・品目配賦の費用データを計算対象テーブルに出力する
	一次配賦基準選択マスタを参照して品目配賦のデータを作成するため
	一次配賦計算を行わないときでも処理を行う必要がある
<ARGUMENTS>
<IN>	I_ARG
		原価計算設定情報レコード
<HISTORY>
**************************************************************************/


PROCEDURE P_MAIN (
	I_ARG	IN MGT_ARG%ROWTYPE
) ;
/**************************************************************************
<SYNOPSIS>
	一次配賦計算のメイン処理
<REMARKS>

<ARGUMENTS>
<IN>	I_ARG
		原価計算設定情報レコード
<HISTORY>
**************************************************************************/

END MGPA_PRE_ALC ;
/
