CREATE OR REPLACE PACKAGE FCPA_GP_BATCH_GRP
-- ==============================================================================
-- 機能      汎用バッチ処理グループ管理
-- 作成者    S.SUZUKI
-- 作成日付  2016-07-27
-- 改版履歴  2016-07-27 S.SUZUKI 初版作成
--
-- バージョン:6.4.0
-- ==============================================================================
IS
	-- ===============================================================================
	-- ログインロケール名称を取得する
	-- ===============================================================================
	FUNCTION F_GET_GP_BATCH_GRP_NM(
		GP_BATCH_GRP IN VARCHAR2
	)
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- ロケール別名称を取得する
	-- ===============================================================================
	FUNCTION F_GET_GP_BATCH_GRP_NM(
		GP_BATCH_GRP IN VARCHAR2 ,
		LCL IN VARCHAR2
	)
	RETURN VARCHAR2 ;
	-- ===============================================================================
	-- 汎用バッチ処理グループを登録する
	-- ===============================================================================
	PROCEDURE ADD_GP_BATCH_GRP(
		GP_BATCH_GRP_CD IN VARCHAR2 ,
		GP_BATCH_GRP_NM IN VARCHAR2 ,
		MODULE_ID IN VARCHAR2,
		LOGIC_ID IN VARCHAR2,
		FUNC_TYP IN VARCHAR2
	);
END;
/

